[{"data":1,"prerenderedAt":102},["ShallowReactive",2],{"content-query-1DxZ1vYQk5":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":5,"title":7,"description":5,"body":8,"_type":96,"_id":97,"_source":98,"_file":99,"_stem":100,"_extension":101},"/","",false,"# The Adventure of Blocky and Friends",{"type":9,"children":10,"toc":93},"root",[11,19,29,34,39,44,49,54,59,64,69,74,79,84],{"type":12,"tag":13,"props":14,"children":16},"element","h1",{"id":15},"the-adventure-of-blocky-and-friends",[17],{"type":18,"value":7},"text",{"type":12,"tag":20,"props":21,"children":22},"p",{},[23],{"type":12,"tag":24,"props":25,"children":28},"img",{"alt":26,"src":27},"DALL·E_2024_08_15_14_28_44_A_black_and_white_coloring_page_in_a.webp","/DALL%C2%B7E_2024_08_15_14_28_44_A_black_and_white_coloring_page_in_a.webp",[],{"type":12,"tag":20,"props":30,"children":31},{},[32],{"type":18,"value":33},"Once upon a time in the blocky world of Roblox, there lived a little square character named Blocky. Blocky was no ordinary character; he had a heart full of kindness and a mind full of curiosity. Every day, Blocky loved to explore the different lands in Roblox, from towering castles to deep underground mines.",{"type":12,"tag":20,"props":35,"children":36},{},[37],{"type":18,"value":38},"One sunny morning, Blocky woke up with a brilliant idea. \"Today, I will build the most amazing treehouse ever!\" he declared. With his trusty toolbox in hand, Blocky set out to gather materials. He met his friends along the way—Builder Bob, Miner Mia, and Engineer Ellie.",{"type":12,"tag":20,"props":40,"children":41},{},[42],{"type":18,"value":43},"\"Can we help?\" asked Builder Bob, who loved to build with big blocks.",{"type":12,"tag":20,"props":45,"children":46},{},[47],{"type":18,"value":48},"\"Of course!\" said Blocky. \"We’ll need lots of wood, nails, and a little bit of magic!\"",{"type":12,"tag":20,"props":50,"children":51},{},[52],{"type":18,"value":53},"They all worked together, cutting down trees (but only the ones that had already fallen!) and hammering the wood into place. As they worked, they laughed and shared stories of their past adventures.",{"type":12,"tag":20,"props":55,"children":56},{},[57],{"type":18,"value":58},"But soon, they realized they were missing something very important—leaves for the roof! \"What will we do now?\" asked Miner Mia, looking up at the bare top of the treehouse.",{"type":12,"tag":20,"props":60,"children":61},{},[62],{"type":18,"value":63},"Just then, a friendly bird named Feather flew down. \"I can help!\" she chirped. \"I know where to find the greenest leaves in all of Robloxia!\"",{"type":12,"tag":20,"props":65,"children":66},{},[67],{"type":18,"value":68},"Blocky and his friends followed Feather to the magical forest, where they found leaves as big as umbrellas! They carefully carried the leaves back to the treehouse and placed them on the roof.",{"type":12,"tag":20,"props":70,"children":71},{},[72],{"type":18,"value":73},"As the sun began to set, Blocky and his friends admired their work. The treehouse was the most amazing one anyone had ever seen, with a roof full of giant green leaves that shimmered in the evening light.",{"type":12,"tag":20,"props":75,"children":76},{},[77],{"type":18,"value":78},"\"Thank you, everyone!\" Blocky said with a big smile. \"This treehouse is not just mine, it's ours!\"",{"type":12,"tag":20,"props":80,"children":81},{},[82],{"type":18,"value":83},"That night, the friends had a sleepover in their new treehouse. They shared stories under the stars, ate marshmallows, and dreamed of the adventures they would have the next day. And so, in the blocky world of Roblox, they lived happily ever after, building, exploring, and having fun together.",{"type":12,"tag":20,"props":85,"children":86},{},[87],{"type":12,"tag":88,"props":89,"children":90},"strong",{},[91],{"type":18,"value":92},"The End.",{"title":5,"searchDepth":94,"depth":94,"links":95},2,[],"markdown","content:index.md","content","index.md","index","md",1723721815376]